import { QuizQuestion } from '../types';

export const quizQuestions: QuizQuestion[] = [
  {
    id: 1,
    question: 'ما هو تاريخ اول يوم شوفتك فية ؟',
    correctAnswer: '22/02/2023',
    options: ['22/02/2023', '15/03/2023', '10/01/2023', '28/02/2023']
  },
  {
    id: 2,
    question: 'اكتر اسم كنت بحب اقولهولك ؟',
    correctAnswer: 'دلوعتي',
    options: ['دلوعتي', 'حبيبتي', 'قلبي', 'روحي']
  },
  {
    id: 3,
    question: 'حاجة في اول معرفتنا كان نفسك تعمليها وعملناها سوا؟',
    correctAnswer: 'نلعب بلايستيشن',
    options: ['نلعب بلايستيشن', 'نتفرج علي فيلم', 'نروح المول', 'ناكل في مطعم']
  }
];

export const compatibilityQuestions = [
  {
    id: 1,
    question: 'ايه افضل لون بالنسبالك؟',
    options: ['الاحمر', 'الاخضر', 'البرتقالي', 'البربل'],
    myAnswer: 'البربل'
  },
  {
    id: 2,
    question: 'ايه اكلتك المفضلة؟',
    hint: 'انا عارف انك مش بتاكلي اصلا بس حاولت 🤭',
    options: ['البطاطس المحمرة', 'البيض', 'البشاميل', 'الرنجة'],
    myAnswer: 'الرنجة'
  },
  {
    id: 3,
    question: 'اذا خيروكي بين العيشة في مكان بتحبيه معايا تختاري ايه؟',
    options: ['البحر', 'الصحرا', 'المخيم', 'بيتنا بس ع البحر برضو 😂'],
    myAnswer: 'بيتنا بس ع البحر برضو 😂'
  }
];
